import java.util.Arrays;
import java.util.List;

public class Main {

	public static void main(String [] args) {

		PostCdFormatter postcdFormatter = new PostCdFormatter();
		List<String> phoneList = Arrays.asList(
				"1050001 ",
				" 050001　",
				"105ー0001",
				" 105-0001");

		for (String phone : phoneList) {
			System.out.println("PostCd=" + postcdFormatter.getPostCd(phone));
		}

		AddressFormatter addressFormatter = new AddressFormatter();
		List<String> addressList = Arrays.asList(
				"長野県上田市常入1-12-11常入コーポa5号室",
				"北海道札幌市北区屯田３条５丁目６番１号",
				"高知県須崎市妙見町１１−３２セゾン・エル１０１号",
				"東京都葛飾区西亀有1丁目12番6号パークハイム西亀303",
				"沖縄県中頭郡北谷町字浜川8",
				"神奈川県川崎市幸区３－１１－１０　サンロイヤルタケミ２０８",
				"静岡県浜松市中区板屋町102-14  3階 神谷治宏方",
				"東京都中央区日本橋浜町2-10-7-205",
				"東京都練馬区高松5-16-7-606",
				"兵庫県西宮市北名次町6-6-1",
				"愛知県岡崎市田口町若草１－３６",
				"東京都中央区佃1-11-9-1702",
				"福岡県飯塚市柏の森６６７－１ セントロイヤル２０２号",
				"兵庫県神戸市中央区布引町2-2-14　ルシャンテN 403号",
				"神奈川県横浜市神奈川区二本榎23ー８",
				"埼玉県草加市草加4-5-1-301",
				"沖縄県那覇市おもろまち 2-3-19",
				"愛知県江南市上奈良町郷196-2",
				"東京都中野区東中野4-5-10-1210",
				"岐阜県各務原市那加前野町4‐90",
				"神奈川県横浜市都筑区仲町台1-14-28 306",
				"神奈川県川崎市宮前区神木本町4-23-4",
				"香川県高松市西宝町1丁目10-12 ツリーハイム402号",
				"熊本県熊本市南区富合町清藤64-15",
				"大分県国東市武蔵町池ノ内1760武蔵グリーンヒル2-9",
				"東京都港区港南４－６－３－３８０３",
				"神奈川県伊勢原市西富岡１０６０－２",
				"兵庫県高砂市百合丘1-62-4",
				"千葉県浦安市猫実2-50-10デュアルコーポ岡善307",
				"埼玉県埼玉県 その他狭山市稲荷山２－３　３ポシケイブ",
				"愛知県豊橋市つつじが丘3丁目6-8",
				"岡山県倉敷市幸町10-41 パークサイド小野A203",
				"愛知県尾張旭市平子ヶ丘町二丁目1－7",
				"埼玉県朝霞市幸町2-5-21-1203",
				"滋賀県草津市馬場町933",
				"東京都世田谷区桜丘２−２−７　プラージュ桜丘２０３",
				"埼玉県さいたま市大宮区三橋1-410-3",
				"兵庫県神戸市西区井吹台西町５−３０−６",
				"埼玉県幸手市北1-8-3市川荘101",
				"神奈川県横浜市中区本牧原21-1-608",
				"愛知県名古屋市中川区三ツ屋町２ー５３",
				"京都府京都市伏見区深草池ノ内町9ー2　深草団地2棟403",
				"東京都墨田区東駒形4-14-5-702",
				"東京都渋谷区恵比寿西２－４－５　第２８荒井ビル５階",
				"神奈川県横浜市中区不老町１－４－１　コンフォート横浜７１１",
				"茨城県高萩市下手綱５8８",
				"岡山県新見市高尾2465-7",
				"岩手県盛岡市新田町10-20-510",
				"愛知県知多市大草字大瀬117-7メイツ新舞子オーシャンコースト304",
				"東京都調布市深大寺元町４－２３－５",
				"滋賀県草津市野路1-17-12-1201",
				"東京都日野市多摩平7-16-12 アドラーブル多摩平201",
				"滋賀県長浜市公園町8-30 サーパス長浜豊公園1104",
				"和歌山県新宮市伊佐田町２−１−２４",
				"東京都目黒区大橋1-10-1プリズムタワー207",
				"愛知県海部郡蟹江町富吉4-102-701",
				"東京都世田谷区北沢3-17-1-101",
				"福岡県福岡市南区塩原4-17-13-802",
				"神奈川県藤沢市亀井野1-16-10",
				"沖縄県那覇市上之屋1丁目15-2　黄金森ガーデンⅡ　301",
				"兵庫県神戸市東灘区青木2-15-11",
				"東京都中央区湊3-4-10-1001",
				"東京都港区六本木2-4-7 パレステュディオ六本木1204",
				"東京都武蔵野市関前3-6-11-106レヂオンス武蔵野パート2",
				"東京都北区田端2-1-2 TKビル305",
				"東京都千代田区サウス1-9-1サウスタワー35F",
				"東京都千代田区サウス1-9-1-3501");

		for (String address : addressList) {
			System.out.println("before:" + addressFormatter.getAddressBeforeStreet(address) + ", " +
					"after:" + addressFormatter.getAddressAfterStreet(address));
		}

	}
}
